Autodesk.Revit.DB.SharedParameterElement.ShouldHideWhenNoValue
Indicates whether the parameter should be hidden from the properties palette if it has no value.
Since:
2016

Autodesk.Revit.DB.SharedParameterElement.Lookup(Autodesk.Revit.DB.Document,System.Guid)
Finds the shared parameter element that corresponds to the given Guid.
document:
The document.
guidValue:
Shared parameter Guid.
Returns:
The retrieved shared parameter instance, or null if the matching element is not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.SharedParameterElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalDefinition)
Creates a new shared parameter element in the document representing the parameter stored in the input ExternalDefinition.
document:
The document.
sharedParameterDefinition:
Shared parameter definition.
Returns:
The newly created shared parameter instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A shared parameter with the assigned GUID is already loaded into the document.
Since:
2016